# Face Mask lightweight variant B: Ghost backbone with Coordinate Attention and reduced deep channels.

nc: 2
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  - [-1, 1, Conv, [32, 3, 2]] # 0-P1/2
  - [-1, 1, GhostConv, [48, 3, 2]] # 1-P2/4
  - [-1, 1, C3Ghost, [48, True]]
  - [-1, 1, GhostConv, [96, 3, 2]] # 3-P3/8
  - [-1, 2, C3Ghost, [96, True]]
  - [-1, 1, GhostConv, [160, 3, 2]] # 5-P4/16
  - [-1, 2, C3Ghost, [160, True]]
  - [-1, 1, CoordinateAttention, [160, 32]]
  - [-1, 1, GhostConv, [224, 3, 2]] # 8-P5/32
  - [-1, 2, C3Ghost, [224, True]]
  - [-1, 1, CoordinateAttention, [224, 32]]
  - [-1, 1, SPPF, [224, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [160]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [96]]

  - [-1, 1, GhostConv, [96, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [160]]

  - [-1, 1, GhostConv, [160, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3Ghost, [224]]

  - [[17, 20, 23], 1, Detect, [nc]]
