# YOLOv8 + MobileNetV3-Small backbone

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [16, 3, 2]]                         # 0-P1/2
  - [-1, 1, MobileNetV3Block, [16, 3, 2, 16, 1, 0]]  # 1-P2/4
  - [-1, 1, MobileNetV3Block, [24, 3, 2, 72, 0, 0]]  # 2-P3/8
  - [-1, 1, MobileNetV3Block, [24, 3, 1, 88, 0, 0]]  # 3
  - [-1, 1, MobileNetV3Block, [40, 5, 2, 96, 1, 1]]  # 4-P4/16
  - [-1, 1, MobileNetV3Block, [40, 5, 1, 240, 1, 1]] # 5
  - [-1, 1, MobileNetV3Block, [40, 5, 1, 240, 1, 1]] # 6
  - [-1, 1, MobileNetV3Block, [48, 5, 1, 120, 1, 1]] # 7
  - [-1, 1, MobileNetV3Block, [48, 5, 1, 144, 1, 1]] # 8
  - [-1, 1, MobileNetV3Block, [96, 5, 2, 288, 1, 1]] # 9-P5/32
  - [-1, 1, MobileNetV3Block, [96, 5, 1, 576, 1, 1]] # 10
  - [-1, 1, MobileNetV3Block, [96, 5, 1, 576, 1, 1]] # 11
  - [-1, 1, SPPF, [96, 5]]                           # 12

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 8], 1, Concat, [1]]
  - [-1, 3, C2f, [48]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 3, C2f, [24]]

  - [-1, 1, Conv, [24, 3, 2]]
  - [[-1, 15], 1, Concat, [1]]
  - [-1, 3, C2f, [48]]

  - [-1, 1, Conv, [48, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, C2f, [96]]

  - [[18, 21, 24], 1, Detect, [nc]]