# YOLOv8 + Half MobileNetV3-Large-style backbone

nc: 80
scales:
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                          # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                         # 1-P2/4
  - [-1, 3, C2f, [128, True]]                          # 2
  - [-1, 1, Conv, [256, 3, 2]]                         # 3-P3/8
  - [-1, 6, C2f, [256, True]]                          # 4  -> keep YOLO low/mid features

  # MobileNetV3-Large-style high-level stages
  - [-1, 1, MobileNetV3Block, [512, 5, 2, 512, 1, 1]]   # 5-P4/16
  - [-1, 1, MobileNetV3Block, [512, 5, 1, 768, 1, 1]]   # 6
  - [-1, 1, MobileNetV3Block, [512, 5, 1, 768, 1, 1]]   # 7

  - [-1, 1, MobileNetV3Block, [960, 5, 2, 960, 1, 1]]   # 8-P5/32
  - [-1, 1, MobileNetV3Block, [960, 5, 1, 1280, 1, 1]]  # 9
  - [-1, 1, MobileNetV3Block, [960, 5, 1, 1280, 1, 1]]  # 10
  - [-1, 1, SPPF, [960, 5]]                             # 11

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                                # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]                                # 17 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]                                # 20 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 3, C2f, [960]]                                # 23 (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]